//=============================================================================
//
// game.h
// Author : koduna hirohito
//
//=============================================================================
#ifndef _GAME_H_			//このマクロ定義がされなかったら
#define _GAME_H_			//2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "object.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CUI;

//*****************************************************************************
// 列挙型
//*****************************************************************************
typedef enum
{
	GAMESTATE_NONE = 0,						//何もしていない状態
	GAMESTATE_NORMAL,						//通常状態
	GAMESTATE_PUSH,							//連打状態
	GAMESTATE_DOWN,							//倒れる状態
	GAMESTATE_MAX
}GAMESTATE;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGame : public CObject
{
private:
	
public:
	CGame();
	~CGame() override;

	HRESULT Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

private:
	CUI *m_pUi;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

D3DXVECTOR3 *GetPosWorld(void);
GAMESTATE GetGameState(void);
void SetGameState(GAMESTATE state);

#endif